/**********************************************************************
//  工程名称：跑马灯实验
//  作    者: 刘博
// 	版权所有：
//  适应芯片: STM32(该工程的IC对像为STM32F103ZET6)
//  实现功能: 跑马灯演示
//
//  系统要求: PC with CPU 233MHz,128MB RAM,
//            Keil uVision 3（or later）

//  硬件连接:
              PB5->LED0->VCC
              PE5->LED1->VCC

//	 CPU运行频率72MHz
//
//  当前版本:  V1.0
//  日期:      2018-08-09
//  参考文件: 
//  维护记录:
**********************************************************************/
//=======================================宏包含=========================================
#include "sys.h"
#include "delay.h"
#include "usart.h"
#include "led.h"
//=======================================主函数=========================================
int main(void)
{	
	//在固件库V3.5中，系统在启动时会调用system_stm32f10x.c中的
  //函数systemInit()对系统时钟进行初始化，
  //在时钟初始化完毕之后会调用main()函数
  //所以不需要再在main()函数中调用SystemInit()函数
	
  delay_init();      //延时函数初始化	  
  LED_Init();        //初始化与LED连接的硬件接口
	
  while(1)
  {
    LED0=0;
	   LED1=1;
	   delay_ms(300);   //延时300ms
	   LED0=1;
	   LED1=0;
	   delay_ms(300);   //延时300ms
  }
}




